Revit 2027 API
AdaptiveComponentInstanceUtils.IsInstanceFlipped Method
 Gets the value of the flip parameter on the adaptive instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsInstanceFlipped(
	FamilyInstance famInst
)
Public Shared Function IsInstanceFlipped (
	famInst As FamilyInstance
) As Boolean
public:
static bool IsInstanceFlipped(
	FamilyInstance^ famInst
)
static member IsInstanceFlipped :
        famInst : FamilyInstance -> bool
Parameters
famInst FamilyInstance
 The FamilyInstance
Return Value
Boolean
 True if the instance is flipped.
Exceptions
Exception | Condition
ArgumentException |  The FamilyInstance famInst is not an Adaptive Family Instance. -or- The FamilyInstance famInst does not have an Adaptive Family Symbol.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AdaptiveComponentInstanceUtils Class
Autodesk.Revit.DB Namespace